In [19]:
import pandas as pd
import numpy as np

In [5]:
area_dict = {'California': 423967, 
             'Texas': 695662, 
             'New York': 141297, 
             'Florida': 170312, 
             'Illinois': 149995} 
area = pd.Series(area_dict)

In [6]:
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [8]:
population_dict = {'California': 38332521, 
                    'Texas': 26448193, 
                    'New York': 19651127, 
                    'Florida': 19552860, 
                    'Illinois': 12882135} 
population = pd.Series(population_dict)

In [9]:
states = pd.DataFrame({'population': population, 'area': area})

In [10]:
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [11]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [12]:
states.columns

Index(['population', 'area'], dtype='object')

In [13]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [14]:
# 创建DataFrame对象
pd.DataFrame(population, columns=['population']) # 通过Series创建

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [15]:
data = [{'a' : i, 'b' : 2*  i} for i in range(3)]
pd.DataFrame(data) # 通过字典创建

   a  b
0  0  0
1  1  2
2  2  4

In [16]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [17]:
pd.DataFrame({'population': population, 'area': area}) #  通过 Series 对象字典创建。

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [20]:
pd.DataFrame(np.random.rand(3, 2), columns=['foo', 'bar'], index=['a', 'b', 'c']) #  通过 NumPy 二维数组创建。

        foo       bar
a  0.911666  0.124771
b  0.402378  0.479457
c  0.226796  0.879331

In [21]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')]) # 通过 NumPy 结构化数组创建。

In [22]:
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [23]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [24]:
# 数据选择方法
area = pd.Series({'California': 423967, 
                  'Texas': 695662, 
                  'New York': 141297, 
                  'Florida': 170312, 
                  'Illinois': 149995}) 
pop = pd.Series({'California': 38332521, 
                 'Texas': 26448193, 
                 'New York': 19651127, 
                 'Florida': 19552860, 
                 'Illinois': 12882135}) 
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [25]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [27]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [28]:
data.area is data['area']

True

In [29]:
data.pop is data['pop']

False

In [30]:
data['density'] = data['pop'] / data['area']

In [31]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [32]:
# 将DataFrame看作二维数组
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [33]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [36]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [37]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [38]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [39]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [45]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [47]:
data.iloc[0, 2] = 90 # 调整数据

In [48]:
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [49]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [51]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [52]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121